Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/rtstream/hardware/isp/hardware/include/regs/rts3915/isp_reg_base.h
#ifndef _ISP_REG_BASE_H_INC_
#define _ISP_REG_BASE_H_INC_

#define SYS_REG_BASE 0x0000
#define DVP_REG_BASE 0x0400
#define FIXP_REG_BASE 0x0800
#define CROP_LONGEXP_REG_BASE 0x0C00
#define CROP_SHORTEXP_REG_BASE 0x20C00
#define BLC_LONGEXP_REG_BASE 0x1000
#define BLC_SHORTEXP_REG_BASE 0x21000
#define DPC_REG_BASE 0x1400
#define RAWSTAT_REG_BASE 0xA800
#define TNR_REG_BASE 0x5800
#define NLSC_REG_BASE 0x1800
#define MLSC_REG_BASE 0x6000
#define AWB_REG_BASE 0xC000
#define AE_REG_BASE 0xBC00
#define AE0_REG_BASE 0x2D400
#define AE1_REG_BASE 0x2D000
#define AF_REG_BASE 0x5C00
#define INTP_REG_BASE 0x1C00
#define CCM_REG_BASE 0x2000
#define GAMMA_REG_BASE 0x2400
#define DEHAZE_REG_BASE 0x8000
#define WDR_REG_BASE 0x4800
#define RGB2YUV_REG_BASE 0x2800
#define YGC_REG_BASE 0x2C00
#define YSTAT_REG_BASE 0xB400
#define UVTUNE_REG_BASE 0x3000
#define FLICK_REG_BASE 0xA000
#define LDC_REG_BASE 0x3400
#define EEH_REG_BASE 0x5000
#define MCROP_REG_BASE 0x4C00
#define SPE_REG_BASE 0x4400
#define YGAMMA_REG_BASE 0x3800
#define MASK_REG_BASE 0x3C00
#define MD_REG_BASE 0x5400
#define ZOOM_REG_BASE 0x4000
#define STATIS_REG_BASE 0xB800
#define SNR_REG_BASE 0x21400
#define FS_REG_BASE 0x21800
#define TM_REG_BASE 0x21C00

#define MIPIIN_REG_BASE 0xC0000
//#define MIPIOUT_REG_BASE 0xD0000
#define VIDEOIN_REG_BASE 0xF0000

#define VIRTUAL_REG_BASE 0x200000

#define REG_OFFSET(MOD, index) ((index) * (MOD##1_REG_BASE - MOD##0_REG_BASE))

#endif /* _ISP_REG_BASE_H_INC_ */

